Revit 2027 API
ParameterTypeId.GridEndSegmentWeight Property
 "End Segment Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GridEndSegmentWeight { get; }
Public Shared ReadOnly Property GridEndSegmentWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GridEndSegmentWeight {
	ForgeTypeId^ get ();
}
static member GridEndSegmentWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace